#include "clock_op.h"

// move_clock_array[i] 表示i+1序号对应的移动影响的时钟个数
int move_clock_array[] = {4, 3, 4, 3, 5, 3, 4, 3, 4, 3, 4};

// 每种移动影响的时钟，1表示会影响，0表示无影响
int move_clock_map[9][9] = {
    {1, 1, 0, 1, 1, 0, 0, 0, 0},
    {1, 1, 1, 0, 0, 0, 0, 0, 0},
    {0, 1, 1, 0, 1, 1, 0, 0, 0},
    {1, 0, 0, 1, 0, 0, 1, 0, 0},
    {0, 1, 0, 1, 1, 1, 0, 1, 0},
    {0, 0, 1, 0, 0, 1, 0, 0, 1},
    {0, 0, 0, 1, 1, 0, 1, 1, 0},
    {0, 0, 0, 0, 0, 0, 1, 1, 1},
    {0, 0, 0, 0, 1, 1, 0, 1, 1},    
};

clock_state init_state = {
    {3, 3, 0},
    {2, 2, 2},
    {2, 1, 2}
};